; domain
(define (domain snake)
(:requirements :equality :negative-preconditions)
(:constants
    dummypoint
)
(:predicates
    ;up down left right of a field
    (ISADJACENT ?x ?y)
    ;the last field of the snake
    (tailsnake ?x)
    ;the first field of the snake
    (headsnake ?x)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y)
    ;a field that is occupied by the snake or by an obstacle
    (blocked ?x)
    ;next point that will spawn
    (spawn ?x)
    ;point y will spawn after point x
    (NEXTSPAWN ?x ?y)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x)
)
(:action move
    :parameters (?head ?newhead ?tail ?newtail)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)

(:action move-and-eat-spawn
    :parameters (?head ?newhead ?spawnpoint ?nextspawnpoint)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (spawn ?spawnpoint)
        (NEXTSPAWN ?spawnpoint ?nextspawnpoint)
        (not (= ?spawnpoint dummypoint))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (ispoint ?spawnpoint)
        (not (spawn ?spawnpoint))
        (spawn ?nextspawnpoint)
    )
)

(:action move-and-eat-no-spawn
    :parameters (?head ?newhead)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (spawn dummypoint)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)

)

; problem
(define (problem snake-empty-3x6-1-5-11-52)
(:domain snake)
(:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos0-5 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos1-5 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4 pos2-5
)
(:init
    (isAdjacent pos0-0 pos1-0)
 (isAdjacent pos0-0 pos0-1)
 (isAdjacent pos0-1 pos1-1)
 (isAdjacent pos0-1 pos0-2)
 (isAdjacent pos0-1 pos0-0)
 (isAdjacent pos0-2 pos1-2)
 (isAdjacent pos0-2 pos0-3)
 (isAdjacent pos0-2 pos0-1)
 (isAdjacent pos0-3 pos1-3)
 (isAdjacent pos0-3 pos0-4)
 (isAdjacent pos0-3 pos0-2)
 (isAdjacent pos0-4 pos1-4)
 (isAdjacent pos0-4 pos0-5)
 (isAdjacent pos0-4 pos0-3)
 (isAdjacent pos0-5 pos1-5)
 (isAdjacent pos0-5 pos0-4)
 (isAdjacent pos1-0 pos2-0)
 (isAdjacent pos1-0 pos1-1)
 (isAdjacent pos1-0 pos0-0)
 (isAdjacent pos1-1 pos2-1)
 (isAdjacent pos1-1 pos1-2)
 (isAdjacent pos1-1 pos0-1)
 (isAdjacent pos1-1 pos1-0)
 (isAdjacent pos1-2 pos2-2)
 (isAdjacent pos1-2 pos1-3)
 (isAdjacent pos1-2 pos0-2)
 (isAdjacent pos1-2 pos1-1)
 (isAdjacent pos1-3 pos2-3)
 (isAdjacent pos1-3 pos1-4)
 (isAdjacent pos1-3 pos0-3)
 (isAdjacent pos1-3 pos1-2)
 (isAdjacent pos1-4 pos2-4)
 (isAdjacent pos1-4 pos1-5)
 (isAdjacent pos1-4 pos0-4)
 (isAdjacent pos1-4 pos1-3)
 (isAdjacent pos1-5 pos2-5)
 (isAdjacent pos1-5 pos0-5)
 (isAdjacent pos1-5 pos1-4)
 (isAdjacent pos2-0 pos2-1)
 (isAdjacent pos2-0 pos1-0)
 (isAdjacent pos2-1 pos2-2)
 (isAdjacent pos2-1 pos1-1)
 (isAdjacent pos2-1 pos2-0)
 (isAdjacent pos2-2 pos2-3)
 (isAdjacent pos2-2 pos1-2)
 (isAdjacent pos2-2 pos2-1)
 (isAdjacent pos2-3 pos2-4)
 (isAdjacent pos2-3 pos1-3)
 (isAdjacent pos2-3 pos2-2)
 (isAdjacent pos2-4 pos2-5)
 (isAdjacent pos2-4 pos1-4)
 (isAdjacent pos2-4 pos2-3)
 (isAdjacent pos2-5 pos1-5)
 (isAdjacent pos2-5 pos2-4)
    (tailSnake pos1-2)
    (headSnake pos2-2)
    (nextSnake pos2-2 pos1-2)
    (blocked pos1-2)
 (blocked pos2-2)
    (spawn pos2-0)
 (nextSpawn pos2-5 dummyPoint)
 (nextSpawn pos2-0 pos0-0)
 (nextSpawn pos0-0 pos2-4)
 (nextSpawn pos2-4 pos1-5)
 (nextSpawn pos1-5 pos1-1)
 (nextSpawn pos1-1 pos0-4)
 (nextSpawn pos0-4 pos0-2)
 (nextSpawn pos0-2 pos0-3)
 (nextSpawn pos0-3 pos2-1)
 (nextSpawn pos2-1 pos1-3)
 (nextSpawn pos1-3 pos2-5)
    (isPoint pos2-3)
 (isPoint pos0-1)
 (isPoint pos1-4)
 (isPoint pos1-0)
 (isPoint pos0-5)
)
(:goal (and
    (not (isPoint pos2-3))
 (not (isPoint pos0-1))
 (not (isPoint pos1-4))
 (not (isPoint pos1-0))
 (not (isPoint pos0-5))
 (not (isPoint pos2-0))
 (not (isPoint pos0-0))
 (not (isPoint pos2-4))
 (not (isPoint pos1-5))
 (not (isPoint pos1-1))
 (not (isPoint pos0-4))
 (not (isPoint pos0-2))
 (not (isPoint pos0-3))
 (not (isPoint pos2-1))
 (not (isPoint pos1-3))
 (not (isPoint pos2-5))
))
)

; plan
1. (move-and-eat-spawn pos2-2 pos2-3 pos2-0 pos0-0)
   deleted: (headsnake pos2-2) (ispoint pos2-3) (spawn pos2-0)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos2-2) (ispoint pos2-0) (spawn pos0-0)
   goals met: 11 of 16
2. (move pos2-3 pos2-4 pos1-2 pos2-2)
   deleted: (headsnake pos2-3) (blocked pos1-2) (tailsnake pos1-2) (nextsnake pos2-2 pos1-2)
   added: (blocked pos2-4) (headsnake pos2-4) (nextsnake pos2-4 pos2-3) (tailsnake pos2-2)
   goals met: 11 of 16
3. (move-and-eat-spawn pos2-4 pos1-4 pos0-0 pos2-4)
   deleted: (headsnake pos2-4) (ispoint pos1-4) (spawn pos0-0)
   added: (blocked pos1-4) (headsnake pos1-4) (nextsnake pos1-4 pos2-4) (ispoint pos0-0) (spawn pos2-4)
   goals met: 11 of 16
4. (move pos1-4 pos0-4 pos2-2 pos2-3)
   deleted: (headsnake pos1-4) (blocked pos2-2) (tailsnake pos2-2) (nextsnake pos2-3 pos2-2)
   added: (blocked pos0-4) (headsnake pos0-4) (nextsnake pos0-4 pos1-4) (tailsnake pos2-3)
   goals met: 11 of 16
5. (move pos0-4 pos0-3 pos2-3 pos2-4)
   deleted: (headsnake pos0-4) (blocked pos2-3) (tailsnake pos2-3) (nextsnake pos2-4 pos2-3)
   added: (blocked pos0-3) (headsnake pos0-3) (nextsnake pos0-3 pos0-4) (tailsnake pos2-4)
   goals met: 11 of 16
6. (move pos0-3 pos1-3 pos2-4 pos1-4)
   deleted: (headsnake pos0-3) (blocked pos2-4) (tailsnake pos2-4) (nextsnake pos1-4 pos2-4)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos0-3) (tailsnake pos1-4)
   goals met: 11 of 16
7. (move pos1-3 pos2-3 pos1-4 pos0-4)
   deleted: (headsnake pos1-3) (blocked pos1-4) (tailsnake pos1-4) (nextsnake pos0-4 pos1-4)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos1-3) (tailsnake pos0-4)
   goals met: 11 of 16
8. (move pos2-3 pos2-2 pos0-4 pos0-3)
   deleted: (headsnake pos2-3) (blocked pos0-4) (tailsnake pos0-4) (nextsnake pos0-3 pos0-4)
   added: (blocked pos2-2) (headsnake pos2-2) (nextsnake pos2-2 pos2-3) (tailsnake pos0-3)
   goals met: 11 of 16
9. (move pos2-2 pos2-1 pos0-3 pos1-3)
   deleted: (headsnake pos2-2) (blocked pos0-3) (tailsnake pos0-3) (nextsnake pos1-3 pos0-3)
   added: (blocked pos2-1) (headsnake pos2-1) (nextsnake pos2-1 pos2-2) (tailsnake pos1-3)
   goals met: 11 of 16
10. (move-and-eat-spawn pos2-1 pos2-0 pos2-4 pos1-5)
   deleted: (headsnake pos2-1) (ispoint pos2-0) (spawn pos2-4)
   added: (blocked pos2-0) (headsnake pos2-0) (nextsnake pos2-0 pos2-1) (ispoint pos2-4) (spawn pos1-5)
   goals met: 11 of 16
11. (move-and-eat-spawn pos2-0 pos1-0 pos1-5 pos1-1)
   deleted: (headsnake pos2-0) (ispoint pos1-0) (spawn pos1-5)
   added: (blocked pos1-0) (headsnake pos1-0) (nextsnake pos1-0 pos2-0) (ispoint pos1-5) (spawn pos1-1)
   goals met: 11 of 16
12. (move-and-eat-spawn pos1-0 pos0-0 pos1-1 pos0-4)
   deleted: (headsnake pos1-0) (ispoint pos0-0) (spawn pos1-1)
   added: (blocked pos0-0) (headsnake pos0-0) (nextsnake pos0-0 pos1-0) (ispoint pos1-1) (spawn pos0-4)
   goals met: 11 of 16
13. (move-and-eat-spawn pos0-0 pos0-1 pos0-4 pos0-2)
   deleted: (headsnake pos0-0) (ispoint pos0-1) (spawn pos0-4)
   added: (blocked pos0-1) (headsnake pos0-1) (nextsnake pos0-1 pos0-0) (ispoint pos0-4) (spawn pos0-2)
   goals met: 11 of 16
14. (move-and-eat-spawn pos0-1 pos1-1 pos0-2 pos0-3)
   deleted: (headsnake pos0-1) (ispoint pos1-1) (spawn pos0-2)
   added: (blocked pos1-1) (headsnake pos1-1) (nextsnake pos1-1 pos0-1) (ispoint pos0-2) (spawn pos0-3)
   goals met: 11 of 16
15. (move pos1-1 pos1-2 pos1-3 pos2-3)
   deleted: (headsnake pos1-1) (blocked pos1-3) (tailsnake pos1-3) (nextsnake pos2-3 pos1-3)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos1-1) (tailsnake pos2-3)
   goals met: 11 of 16
16. (move-and-eat-spawn pos1-2 pos0-2 pos0-3 pos2-1)
   deleted: (headsnake pos1-2) (ispoint pos0-2) (spawn pos0-3)
   added: (blocked pos0-2) (headsnake pos0-2) (nextsnake pos0-2 pos1-2) (ispoint pos0-3) (spawn pos2-1)
   goals met: 11 of 16
17. (move-and-eat-spawn pos0-2 pos0-3 pos2-1 pos1-3)
   deleted: (headsnake pos0-2) (ispoint pos0-3) (spawn pos2-1)
   added: (blocked pos0-3) (headsnake pos0-3) (nextsnake pos0-3 pos0-2) (ispoint pos2-1) (spawn pos1-3)
   goals met: 11 of 16
18. (move-and-eat-spawn pos0-3 pos0-4 pos1-3 pos2-5)
   deleted: (headsnake pos0-3) (ispoint pos0-4) (spawn pos1-3)
   added: (blocked pos0-4) (headsnake pos0-4) (nextsnake pos0-4 pos0-3) (ispoint pos1-3) (spawn pos2-5)
   goals met: 11 of 16
19. (move-and-eat-spawn pos0-4 pos0-5 pos2-5 dummypoint)
   deleted: (headsnake pos0-4) (ispoint pos0-5) (spawn pos2-5)
   added: (blocked pos0-5) (headsnake pos0-5) (nextsnake pos0-5 pos0-4) (ispoint pos2-5) (spawn dummypoint)
   goals met: 11 of 16
20. (move-and-eat-no-spawn pos0-5 pos1-5)
   deleted: (headsnake pos0-5) (ispoint pos1-5)
   added: (blocked pos1-5) (headsnake pos1-5) (nextsnake pos1-5 pos0-5)
   goals met: 12 of 16
21. (move-and-eat-no-spawn pos1-5 pos2-5)
   deleted: (headsnake pos1-5) (ispoint pos2-5)
   added: (blocked pos2-5) (headsnake pos2-5) (nextsnake pos2-5 pos1-5)
   goals met: 13 of 16
22. (move-and-eat-no-spawn pos2-5 pos2-4)
   deleted: (headsnake pos2-5) (ispoint pos2-4)
   added: (blocked pos2-4) (headsnake pos2-4) (nextsnake pos2-4 pos2-5)
   goals met: 14 of 16
23. (move pos2-4 pos1-4 pos2-3 pos2-2)
   deleted: (headsnake pos2-4) (blocked pos2-3) (tailsnake pos2-3) (nextsnake pos2-2 pos2-3)
   added: (blocked pos1-4) (headsnake pos1-4) (nextsnake pos1-4 pos2-4) (tailsnake pos2-2)
   goals met: 14 of 16
24. (move-and-eat-no-spawn pos1-4 pos1-3)
   deleted: (headsnake pos1-4) (ispoint pos1-3)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos1-4)
   goals met: 15 of 16
25. (move pos1-3 pos2-3 pos2-2 pos2-1)
   deleted: (headsnake pos1-3) (blocked pos2-2) (tailsnake pos2-2) (nextsnake pos2-1 pos2-2)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos1-3) (tailsnake pos2-1)
   goals met: 15 of 16
26. (move pos2-3 pos2-2 pos2-1 pos2-0)
   deleted: (headsnake pos2-3) (blocked pos2-1) (tailsnake pos2-1) (nextsnake pos2-0 pos2-1)
   added: (blocked pos2-2) (headsnake pos2-2) (nextsnake pos2-2 pos2-3) (tailsnake pos2-0)
   goals met: 15 of 16
27. (move-and-eat-no-spawn pos2-2 pos2-1)
   deleted: (headsnake pos2-2) (ispoint pos2-1)
   added: (blocked pos2-1) (headsnake pos2-1) (nextsnake pos2-1 pos2-2)
   goals met: 16 of 16
